InformationRegisters/ИзмененияРеквизитовОбъектовИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияРеквизитовОбъектовИБ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДействияПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеПроверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БП_Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_СписаниеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВозвратГПВПереработку</v8:Type>
						<v8:Type>cfg:DocumentRef.БП_Оповещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаИзменениеУсловийКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОтгрузку</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_Бюджет</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетнаяОперация</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗакрытиеОстатков</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаСогласованиеДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СогласованиеМассиваДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВыплатаЗП</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ДвижениеДС</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПереводТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПродажНовый</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредставительскиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ОбращенияВТехПоддержку</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровыеДвижения</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаТорговлю</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Начисления903</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.РасходыБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_НачислениеЗП</v8:Type>
						<v8:Type>cfg:CatalogRef.Учредители</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоходыБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_НЗВ</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ЗакрытиеПериода</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_РасчетПроцентов</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКорректировкуБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПеремещениеМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_КорректировкаДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Д_МаршрутыЗаявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_СлужебнаяЗаписка</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаФинансирование</v8:Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_АктСверкиВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_ЗаявкаНаКадровоеДвижение</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Д_БюджетПрочихПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ВзаимозачетыПредприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Возврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_Операция</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркетинговоеМероприятие</v8:Type>
						<v8:Type>cfg:DocumentRef.УЧ_ПереоценкаВалютныхОстатков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияРеквизитовОбъектовИБ/Forms/ФормаАрхивацииИУдаления/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьАрхивацию(Команда)
	
	ВыполнитьАрхивациюНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуАрхиваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	Диалог.ПолноеИмяФайла	= ПутьКФайлуАрхива;
	Диалог.Фильтр			= "Архив zip (*.zip)|*.zip";

	Результат = Диалог.Выбрать();

	Если Результат Тогда
		ПутьКФайлуАрхива = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАрхивациюНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.ИзмененияРеквизитовОбъектовИБ КАК Регистр
	|ГДЕ
	|	Регистр.Период МЕЖДУ &НачПериода И &КонПериода";
	Запрос.УстановитьПараметр("НачПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Период.ДатаОкончания));
	
	СтруктураЗаписи = Новый Структура("Период, Объект, ИмяРеквизита, ИмяТабличнойЧасти, НомерСтрокиТЧ, СтароеЗначение, НовоеЗначение, Пользователь, ТипДействияПользователя");
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если Архивировать Тогда
		КаталогВременныхФайлов = КаталогВременныхФайлов();
		// Запись в XML
		ИмяФайла	= КаталогВременныхФайлов + "\Reg " + СтрЗаменить(Строка(ТекущаяДата()), ":", " ");
		ИмяФайлаХМЛ	= ИмяФайла + ".xml";
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(ИмяФайлаХМЛ);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Начало");
		
		ТекущийНомерЗаписи = 0;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекущийНомерЗаписи = ТекущийНомерЗаписи + 1;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Запись" + Формат(ТекущийНомерЗаписи, "ЧГ=0"));
			
			Для Каждого КлючИЗначение Из СтруктураЗаписи Цикл
				Ключ = КлючИЗначение.Ключ;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента(Ключ);
				ЗаписатьXML(ЗаписьXML, Выборка[Ключ]);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;

		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();
		
		// Архивация	
		ЗаписьЗИП = Новый ЗаписьZipФайла(?(Прав(ПутьКФайлуАрхива, 4) = ".zip", ПутьКФайлуАрхива, ПутьКФайлуАрхива + ".zip"));
		ЗаписьЗИП.Добавить(ИмяФайлаХМЛ);
		ЗаписьЗИП.Записать();
		
		// Удаление файла ХМЛ
		Попытка
			УдалитьФайлы(ИмяФайлаХМЛ);
		Исключение
			Сообщить("Не удалось удалить файл " + ИмяФайлаХМЛ + "." + Символы.ПС +
					ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Если Удалять Тогда
		НачатьТранзакцию();
		
		// Создаем и заполняем структуру для отбора набора записей регистра сведений
		СтруктураОтбора		= Новый Структура;
		МетаданныеРегистра	= Метаданные.РегистрыСведений.ИзмененияРеквизитовОбъектовИБ;
		
		Для Каждого Измерение ИЗ МетаданныеРегистра.Измерения Цикл
			СтруктураОтбора.Вставить(Измерение.Имя);
		КонецЦикла;
		
		Для Каждого Реквизит ИЗ МетаданныеРегистра.СтандартныеРеквизиты Цикл
			СтруктураОтбора.Вставить(Реквизит.Имя);		
		КонецЦикла;
		
		// создаем набор записей регистра
		НаборЗаписей = РегистрыСведений.ИзмененияРеквизитовОбъектовИБ.СоздатьНаборЗаписей();
		Выборка		 = Результат.Выбрать();	
		
		Пока Выборка.Следующий() Цикл
			
			Для Каждого Элемент Из СтруктураОтбора Цикл
				НаборЗаписей.Отбор[Элемент.Ключ].Установить(Выборка[Элемент.Ключ]);
			КонецЦикла;
			
			НаборЗаписей.Записать();
			НаборЗаписей.Очистить();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьУдалениеАрхивациюЗаписейРегистра

&НаКлиенте
Процедура ПросмотрСодержимогоФайлаАрхива(Команда)
		
	ИмяФайла = ПутьКФайлуАрхива;
	ТекФайл	 = Новый Файл(ИмяФайла);
	
	Если Не ТекФайл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеЗИП = Новый ЧтениеZipФайла(ИмяФайла);
	
	Если ЧтениеЗИП.Элементы.Количество() = 0 Тогда
		Предупреждение("Выбранный архив не содержит ни одного файла", 120);
		Возврат;
	КонецЕсли;
	
	ЭлементЗИП = ЧтениеЗИП.Элементы[0];
	
	Если Не ЭлементЗИП.Расширение  = "xml" Тогда
		Предупреждение("Первый файл в архиве не файл xml. Это не архив изменений." +
				Символы.ПС + "Архив открыт не будет", 120);
		Возврат;
	КонецЕсли;
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ЧтениеЗИП.Извлечь(ЭлементЗИП, КаталогВременныхФайлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	
	ИмяФайла= КаталогВременныхФайлов + "\" + ЭлементЗИП.Имя;
	ТекФайл	= Новый Файл(ИмяФайла);
	
	Если Не ТекФайл.Существует() Тогда
		Возврат;
	КонецЕсли;
		
	ПросмотрСодержимогоФайлаАрхиваНаСервере(ИмяФайла);
	
	Элементы.Список.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПросмотрСодержимогоФайлаАрхиваНаСервере(ИмяФайла)
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	ЧтениеХМЛ.ОткрытьФайл(ИмяФайла);
	
	ТаблицаЗначенийИзФайла	= Новый ТаблицаЗначений;
	КолонкиТЗ				= ТаблицаЗначенийИзФайла.Колонки;
	
	Пока ЧтениеХМЛ.Прочитать() Цикл
		Если ЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяУзла = ЧтениеХМЛ.Имя;
			
			Если ИмяУзла = "Начало" Тогда
				Продолжить;
			КонецЕсли;
			
			Если Найти(ИмяУзла, "Запись") > 0 Тогда
				СтрокаТЗ = ТаблицаЗначенийИзФайла.Добавить();
				ЧтениеХМЛ.Прочитать();
			КонецЕсли;
			
			ИмяУзла = ЧтениеХМЛ.Имя;
			Если КолонкиТЗ.Найти(ИмяУзла) = Неопределено Тогда
				КолонкиТЗ.Добавить(ИмяУзла);
			КонецЕсли;
			
			ЧтениеХМЛ.Прочитать();
			
			СтрокаТЗ[ИмяУзла] = ПрочитатьXML(ЧтениеХМЛ);
			
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаЗначенийИзФайла, "Список");
		
КонецПроцедуры	

&НаКлиенте
Процедура ПутьКФайлуАрхиваОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	Если НЕ ПустаяСтрока(ПутьКФайлуАрхива) Тогда
		ЗапуститьПриложение("explorer " + ПутьКФайлуАрхива);
	КонецЕсли;
	
КонецПроцедуры
